Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.7.217/saml21a1/include/component/mclk.h
/*
 * Component description for MCLK
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2018-06-06T13:39:06Z */
#ifndef _SAML21_MCLK_COMPONENT_H_
#define _SAML21_MCLK_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR MCLK                                         */
/* ************************************************************************** */

/* -------- MCLK_CTRLA : (MCLK Offset: 0x00) (R/W 8) Control A -------- */
#define MCLK_CTRLA_RESETVALUE                 _UINT8_(0x00)                                        /*  (MCLK_CTRLA) Control A  Reset Value */

#define MCLK_CTRLA_CFDEN_Pos                  _UINT8_(2)                                           /* (MCLK_CTRLA) Clock Failure Detector Enable Position */
#define MCLK_CTRLA_CFDEN_Msk                  (_UINT8_(0x1) << MCLK_CTRLA_CFDEN_Pos)               /* (MCLK_CTRLA) Clock Failure Detector Enable Mask */
#define MCLK_CTRLA_CFDEN(value)               (MCLK_CTRLA_CFDEN_Msk & (_UINT8_(value) << MCLK_CTRLA_CFDEN_Pos)) /* Assigment of value for CFDEN in the MCLK_CTRLA register */
#define MCLK_CTRLA_EMCLK_Pos                  _UINT8_(4)                                           /* (MCLK_CTRLA) Emergency Clock Select Position */
#define MCLK_CTRLA_EMCLK_Msk                  (_UINT8_(0x1) << MCLK_CTRLA_EMCLK_Pos)               /* (MCLK_CTRLA) Emergency Clock Select Mask */
#define MCLK_CTRLA_EMCLK(value)               (MCLK_CTRLA_EMCLK_Msk & (_UINT8_(value) << MCLK_CTRLA_EMCLK_Pos)) /* Assigment of value for EMCLK in the MCLK_CTRLA register */
#define MCLK_CTRLA_Msk                        _UINT8_(0x14)                                        /* (MCLK_CTRLA) Register Mask  */


/* -------- MCLK_INTENCLR : (MCLK Offset: 0x01) (R/W 8) Interrupt Enable Clear -------- */
#define MCLK_INTENCLR_RESETVALUE              _UINT8_(0x00)                                        /*  (MCLK_INTENCLR) Interrupt Enable Clear  Reset Value */

#define MCLK_INTENCLR_CKRDY_Pos               _UINT8_(0)                                           /* (MCLK_INTENCLR) Clock Ready Interrupt Enable Position */
#define MCLK_INTENCLR_CKRDY_Msk               (_UINT8_(0x1) << MCLK_INTENCLR_CKRDY_Pos)            /* (MCLK_INTENCLR) Clock Ready Interrupt Enable Mask */
#define MCLK_INTENCLR_CKRDY(value)            (MCLK_INTENCLR_CKRDY_Msk & (_UINT8_(value) << MCLK_INTENCLR_CKRDY_Pos)) /* Assigment of value for CKRDY in the MCLK_INTENCLR register */
#define MCLK_INTENCLR_CFD_Pos                 _UINT8_(1)                                           /* (MCLK_INTENCLR) Clock Failure Detector Interrupt Enable Position */
#define MCLK_INTENCLR_CFD_Msk                 (_UINT8_(0x1) << MCLK_INTENCLR_CFD_Pos)              /* (MCLK_INTENCLR) Clock Failure Detector Interrupt Enable Mask */
#define MCLK_INTENCLR_CFD(value)              (MCLK_INTENCLR_CFD_Msk & (_UINT8_(value) << MCLK_INTENCLR_CFD_Pos)) /* Assigment of value for CFD in the MCLK_INTENCLR register */
#define MCLK_INTENCLR_Msk                     _UINT8_(0x03)                                        /* (MCLK_INTENCLR) Register Mask  */


/* -------- MCLK_INTENSET : (MCLK Offset: 0x02) (R/W 8) Interrupt Enable Set -------- */
#define MCLK_INTENSET_RESETVALUE              _UINT8_(0x00)                                        /*  (MCLK_INTENSET) Interrupt Enable Set  Reset Value */

#define MCLK_INTENSET_CKRDY_Pos               _UINT8_(0)                                           /* (MCLK_INTENSET) Clock Ready Interrupt Enable Position */
#define MCLK_INTENSET_CKRDY_Msk               (_UINT8_(0x1) << MCLK_INTENSET_CKRDY_Pos)            /* (MCLK_INTENSET) Clock Ready Interrupt Enable Mask */
#define MCLK_INTENSET_CKRDY(value)            (MCLK_INTENSET_CKRDY_Msk & (_UINT8_(value) << MCLK_INTENSET_CKRDY_Pos)) /* Assigment of value for CKRDY in the MCLK_INTENSET register */
#define MCLK_INTENSET_CFD_Pos                 _UINT8_(1)                                           /* (MCLK_INTENSET) Clock Failure Detector Interrupt Enable Position */
#define MCLK_INTENSET_CFD_Msk                 (_UINT8_(0x1) << MCLK_INTENSET_CFD_Pos)              /* (MCLK_INTENSET) Clock Failure Detector Interrupt Enable Mask */
#define MCLK_INTENSET_CFD(value)              (MCLK_INTENSET_CFD_Msk & (_UINT8_(value) << MCLK_INTENSET_CFD_Pos)) /* Assigment of value for CFD in the MCLK_INTENSET register */
#define MCLK_INTENSET_Msk                     _UINT8_(0x03)                                        /* (MCLK_INTENSET) Register Mask  */


/* -------- MCLK_INTFLAG : (MCLK Offset: 0x03) (R/W 8) Interrupt Flag Status and Clear -------- */
#define MCLK_INTFLAG_RESETVALUE               _UINT8_(0x01)                                        /*  (MCLK_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

#define MCLK_INTFLAG_CKRDY_Pos                _UINT8_(0)                                           /* (MCLK_INTFLAG) Clock Ready Position */
#define MCLK_INTFLAG_CKRDY_Msk                (_UINT8_(0x1) << MCLK_INTFLAG_CKRDY_Pos)             /* (MCLK_INTFLAG) Clock Ready Mask */
#define MCLK_INTFLAG_CKRDY(value)             (MCLK_INTFLAG_CKRDY_Msk & (_UINT8_(value) << MCLK_INTFLAG_CKRDY_Pos)) /* Assigment of value for CKRDY in the MCLK_INTFLAG register */
#define MCLK_INTFLAG_CFD_Pos                  _UINT8_(1)                                           /* (MCLK_INTFLAG) Clock Failure Detector Position */
#define MCLK_INTFLAG_CFD_Msk                  (_UINT8_(0x1) << MCLK_INTFLAG_CFD_Pos)               /* (MCLK_INTFLAG) Clock Failure Detector Mask */
#define MCLK_INTFLAG_CFD(value)               (MCLK_INTFLAG_CFD_Msk & (_UINT8_(value) << MCLK_INTFLAG_CFD_Pos)) /* Assigment of value for CFD in the MCLK_INTFLAG register */
#define MCLK_INTFLAG_Msk                      _UINT8_(0x03)                                        /* (MCLK_INTFLAG) Register Mask  */


/* -------- MCLK_CPUDIV : (MCLK Offset: 0x04) (R/W 8) CPU Clock Division -------- */
#define MCLK_CPUDIV_RESETVALUE                _UINT8_(0x01)                                        /*  (MCLK_CPUDIV) CPU Clock Division  Reset Value */

